# Pandas Series

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a', 'b','c','d']
mylist = [10,20,30,40]
arr1 = np.array(mylist)
d = {'a':10, 'b':20, 'c':30}
d

{'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(data=mylist)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
pd.Series(data = mylist, index = labels)

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series(mylist, labels)

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
pd.Series(arr1, labels)

a    10
b    20
c    30
d    40
dtype: int32

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(labels)

0    a
1    b
2    c
3    d
dtype: object

In [10]:
ser1= pd.Series(['china','india','usa','nepal'],[1,2,3,4])
ser1

1    china
2    india
3      usa
4    nepal
dtype: object

In [11]:
ser1[3]

'usa'

In [12]:
ser2= pd.Series([1,2,3,4],['china','india','usa','nepal'])
ser2

china    1
india    2
usa      3
nepal    4
dtype: int64

In [13]:
ser2['nepal']

4

In [14]:
ser2 + 2

china    3
india    4
usa      5
nepal    6
dtype: int64

In [15]:
ser3 = pd.Series(data=mylist, index= ['china','india','usa','italy'])
ser3

china    10
india    20
usa      30
italy    40
dtype: int64

In [16]:
ser2 + ser3

china    11.0
india    22.0
italy     NaN
nepal     NaN
usa      33.0
dtype: float64

# Pandas DataFrames

In [17]:
from numpy.random import randn

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [19]:
df['W']

A   -1.107065
B    0.276543
C   -0.920543
D   -0.499412
E   -0.315508
Name: W, dtype: float64

In [20]:
type(df['W'])

pandas.core.series.Series

In [21]:
df.X

A    0.091200
B    1.076299
C   -0.844686
D    0.402215
E    1.553499
Name: X, dtype: float64

In [22]:
df[['W','X']]

          W         X
A -1.107065  0.091200
B  0.276543  1.076299
C -0.920543 -0.844686
D -0.499412  0.402215
E -0.315508  1.553499

In [23]:
df['new']=df['Y'] + df['Z']
df['new']

A    0.944812
B   -2.619625
C    0.742285
D   -1.897848
E   -0.109577
Name: new, dtype: float64

In [24]:
df

          W         X         Y         Z       new
A -1.107065  0.091200 -0.081702  1.026514  0.944812
B  0.276543  1.076299 -1.422360 -1.197264 -2.619625
C -0.920543 -0.844686  0.317324  0.424960  0.742285
D -0.499412  0.402215 -1.515371 -0.382477 -1.897848
E -0.315508  1.553499 -0.433998  0.324421 -0.109577

In [25]:
df.drop('new', axis = 1)

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [26]:
df

          W         X         Y         Z       new
A -1.107065  0.091200 -0.081702  1.026514  0.944812
B  0.276543  1.076299 -1.422360 -1.197264 -2.619625
C -0.920543 -0.844686  0.317324  0.424960  0.742285
D -0.499412  0.402215 -1.515371 -0.382477 -1.897848
E -0.315508  1.553499 -0.433998  0.324421 -0.109577

In [27]:
df.drop('new', axis=1, inplace=True)

In [28]:
df

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [29]:
df.drop('A')

          W         X         Y         Z
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [30]:
df

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [31]:
df.shape

(5, 4)

In [32]:
df.loc['C']

W   -0.920543
X   -0.844686
Y    0.317324
Z    0.424960
Name: C, dtype: float64

In [33]:
type(df.loc['A'])

pandas.core.series.Series

In [34]:
df.iloc[2]

W   -0.920543
X   -0.844686
Y    0.317324
Z    0.424960
Name: C, dtype: float64

In [35]:
df.loc['C','W']

-0.9205434768660339

In [36]:
df.iloc[2,0]

-0.9205434768660339

In [37]:
df.loc[['C','D','E'],['X','Y']]

          X         Y
C -0.844686  0.317324
D  0.402215 -1.515371
E  1.553499 -0.433998

In [38]:
df

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [39]:
df.iloc[2:5,1:3]

          X         Y
C -0.844686  0.317324
D  0.402215 -1.515371
E  1.553499 -0.433998

In [40]:
booldf = df>0

In [41]:
booldf

       W      X      Y      Z
A  False   True  False   True
B   True   True  False  False
C  False  False   True   True
D  False   True  False  False
E  False   True  False   True

In [42]:
df[booldf]

          W         X         Y         Z
A       NaN  0.091200       NaN  1.026514
B  0.276543  1.076299       NaN       NaN
C       NaN       NaN  0.317324  0.424960
D       NaN  0.402215       NaN       NaN
E       NaN  1.553499       NaN  0.324421

In [43]:
df[df>0]

          W         X         Y         Z
A       NaN  0.091200       NaN  1.026514
B  0.276543  1.076299       NaN       NaN
C       NaN       NaN  0.317324  0.424960
D       NaN  0.402215       NaN       NaN
E       NaN  1.553499       NaN  0.324421

In [44]:
df['W']>0

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [45]:
df[df['W']>0]

          W         X        Y         Z
B  0.276543  1.076299 -1.42236 -1.197264

In [46]:
df

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [47]:
df['Z']<0

A    False
B     True
C    False
D     True
E    False
Name: Z, dtype: bool

In [48]:
dfzlt0 = df[df['Z']<0]

In [49]:
dfzlt0

          W         X         Y         Z
B  0.276543  1.076299 -1.422360 -1.197264
D -0.499412  0.402215 -1.515371 -0.382477

In [50]:
dfzgt0 = df[df['Z']>0]
dfzgt0

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
C -0.920543 -0.844686  0.317324  0.424960
E -0.315508  1.553499 -0.433998  0.324421

In [57]:
dfzgt0['W']

A   -1.107065
C   -0.920543
E   -0.315508
Name: W, dtype: float64

In [58]:
df[df['Z']>0]['W']

A   -1.107065
C   -0.920543
E   -0.315508
Name: W, dtype: float64

In [62]:
dfzgt0.loc['E','W']

-0.31550848144638766

In [63]:
dfzgt0.loc[['C'],['X','Y']]

          X         Y
C -0.844686  0.317324

In [64]:
df[df['Z']>0].loc[['C'],['X','Y']]

          X         Y
C -0.844686  0.317324

In [65]:
dfzgt0.iloc[1:2,1:3]

          X         Y
C -0.844686  0.317324

In [ ]:
df[df['Z']>0].iloc[1:2,1:3]

In [75]:
df[(df['X']>0) and (df['Y']<1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [76]:
# '&' instead of 'and'

In [77]:
df[(df['X']>0) & (df['Y']<0)]

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [78]:
df[(df['X']>0) or (df['Y']<1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [70]:
# '|(pipe operator)' instead of 'or'

In [80]:
df[(df['X']>0) | (df['Y']>0)]

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [81]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.107065  0.091200 -0.081702  1.026514
1     B  0.276543  1.076299 -1.422360 -1.197264
2     C -0.920543 -0.844686  0.317324  0.424960
3     D -0.499412  0.402215 -1.515371 -0.382477
4     E -0.315508  1.553499 -0.433998  0.324421

In [82]:
df

          W         X         Y         Z
A -1.107065  0.091200 -0.081702  1.026514
B  0.276543  1.076299 -1.422360 -1.197264
C -0.920543 -0.844686  0.317324  0.424960
D -0.499412  0.402215 -1.515371 -0.382477
E -0.315508  1.553499 -0.433998  0.324421

In [83]:
newind = 'CH IN US UK NP'.split()
newind

['CH', 'IN', 'US', 'UK', 'NP']

In [84]:
df['Nations'] = newind
df

          W         X         Y         Z Nations
A -1.107065  0.091200 -0.081702  1.026514      CH
B  0.276543  1.076299 -1.422360 -1.197264      IN
C -0.920543 -0.844686  0.317324  0.424960      US
D -0.499412  0.402215 -1.515371 -0.382477      UK
E -0.315508  1.553499 -0.433998  0.324421      NP

In [85]:
df.set_index('Nations')

                W         X         Y         Z
Nations
CH      -1.107065  0.091200 -0.081702  1.026514
IN       0.276543  1.076299 -1.422360 -1.197264
US      -0.920543 -0.844686  0.317324  0.424960
UK      -0.499412  0.402215 -1.515371 -0.382477
NP      -0.315508  1.553499 -0.433998  0.324421

In [86]:
#df.drop('Nations', axis=1, inplace = True)

In [87]:
df

          W         X         Y         Z Nations
A -1.107065  0.091200 -0.081702  1.026514      CH
B  0.276543  1.076299 -1.422360 -1.197264      IN
C -0.920543 -0.844686  0.317324  0.424960      US
D -0.499412  0.402215 -1.515371 -0.382477      UK
E -0.315508  1.553499 -0.433998  0.324421      NP

# Multi-index and Index hierarchy

In [88]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [89]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [90]:
daf = pd.DataFrame(randn(6,2),hier_index,['A','B'])
daf

             A         B
G1 1 -0.895003  0.037897
   2  1.863898 -0.155628
   3  1.214655  0.614951
G2 1  0.602145  0.287726
   2 -2.698111 -0.685502
   3 -0.296956 -1.026189

In [91]:
daf.loc['G1']

          A         B
1 -0.895003  0.037897
2  1.863898 -0.155628
3  1.214655  0.614951

In [92]:
daf.loc['G1'].loc[1]

A   -0.895003
B    0.037897
Name: 1, dtype: float64

In [93]:
daf.loc['G1',1]

A   -0.895003
B    0.037897
Name: (G1, 1), dtype: float64

In [94]:
daf.index.names = ['Groups','Nums']

In [95]:
daf

                    A         B
Groups Nums
G1     1    -0.895003  0.037897
       2     1.863898 -0.155628
       3     1.214655  0.614951
G2     1     0.602145  0.287726
       2    -2.698111 -0.685502
       3    -0.296956 -1.026189

In [96]:
daf.loc['G2',2]['B']

-0.6855017598831368

In [97]:
daf.loc['G2']

             A         B
Nums
1     0.602145  0.287726
2    -2.698111 -0.685502
3    -0.296956 -1.026189

In [98]:
daf.loc['G2'].iloc[1:3,:]

             A         B
Nums
2    -2.698111 -0.685502
3    -0.296956 -1.026189

In [99]:
daf.xs(2,level='Nums')

               A         B
Groups
G1      1.863898 -0.155628
G2     -2.698111 -0.685502

In [100]:
daf.xs(2,level = 'Nums').loc['G1']

A    1.863898
B   -0.155628
Name: G1, dtype: float64

In [101]:
daf.xs(2,level = 'Nums').iloc[0:1,:]

               A         B
Groups
G1      1.863898 -0.155628

In [102]:
daf.xs(2,level = 'Nums')['A']

Groups
G1    1.863898
G2   -2.698111
Name: A, dtype: float64

In [103]:
daf.xs(2,level = 'Nums').iloc[:,0:1]

               A
Groups
G1      1.863898
G2     -2.698111